
Процедура ПередЗаписью(Отказ)
	
Если Не ЗначениеЗаполнено(Порядок) Тогда
		
		МаксПорядок = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Каталоги.Порядок КАК Порядок
		|ИЗ
		|	Справочник.Каталоги КАК Каталоги
		|ГДЕ
		|	Каталоги.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок УБЫВ";
		Запрос.УстановитьПараметр("Родитель", Родитель);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			МаксПорядок = ВыборкаДетальныеЗаписи.Порядок;
		КонецЕсли;
		
		Порядок = МаксПорядок + 1;
		
	КонецЕсли;
	

КонецПроцедуры

