

#Область СобытияФормы
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНаборФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого Стр Из Объект.Данные Цикл
		Стр.ПарольБезШифрования = ПолучитьПарольДляСтрокиНаСервере(Объект.Данные.Индекс(стр));
	КонецЦикла;
	
	Элементы.ДанныеПарольБезШифрования.РежимПароля = Истина;
	ЭтаФорма.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаПаролей = ТекущийОбъект.Данные.Выгрузить();
	
	Для каждого Стр Из ТаблицаПаролей Цикл
		Стр.Пароль = МодульКриптографииСервер.ПолучитьЗашифрованныеДанные(Объект.Данные[ТаблицаПаролей.Индекс(стр)].ПарольБезШифрования, ПараметрыСеанса.МастерПароль);
		Если Не ЗначениеЗаполнено(Стр.ID) Тогда
			Стр.ID = Новый УникальныйИдентификатор();
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Для каждого Стр Из Объект.Данные Цикл
		Стр.ПарольБезШифрования = ПолучитьПарольДляСтрокиНаСервере(Объект.Данные.Индекс(стр));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере (МассивПриложений, Скрытый)
	РегистрыСведений.Файлы.ЗаписатьФайлы(МассивПриложений, Объект.Ссылка, Скрытый);
КонецПроцедуры

#КонецОбласти


&НаСервере
Функция ПолучитьПарольДляСтрокиНаСервере(Индекс)
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = МодульКриптографииСервер.ПолучитьРасшифрованныеДанные(Об.Данные[Индекс].Пароль, ПараметрыСеанса.МастерПароль);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВклВыклРежимПароля(Команда)
	
	Элементы.ДанныеПарольБезШифрования.РежимПароля = Не Элементы.ДанныеПарольБезШифрования.РежимПароля;
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	// Костыль. Работает. Не знаю почему
	ЭтаФорма.ТолькоПросмотр = Не ЭтаФорма.ТолькоПросмотр;
	ЭтаФорма.ТолькоПросмотр = Не ЭтаФорма.ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ВклВыклРежимРедактирования(Команда)
	ЭтаФорма.ТолькоПросмотр = Не ЭтаФорма.ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЛогин(Команда)
	
	COMОбъект = Новый COMОбъект("htmlfile"); 
	COMОбъект.ParentWindow.ClipboardData.Setdata("Text", Элементы.Данные.ТекущиеДанные.Логин); 
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПароль(Команда)
	
	COMОбъект = Новый COMОбъект("htmlfile"); 
	COMОбъект.ParentWindow.ClipboardData.Setdata("Text", Элементы.Данные.ТекущиеДанные.ПарольБезШифрования); 
	
КонецПроцедуры


#Область Вложения

&НаКлиенте
Процедура ПриложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина; // Аналог стандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АдресВХранилище = "";
		ВыбранноеИмяФайла = "";
		Если ПоместитьФайл(АдресВХранилище, , ВыбранноеИмяФайла, Истина, ЭтаФорма.УникальныйИдентификатор) Тогда
			ЗаписатьПриложениеНаСервере(ВыбранноеИмяФайла, АдресВХранилище);
		КонецЕсли;
		ПрочитатьНаборФайлов();
	Иначе
		Предупреждение("Перед добавлением необходимо записать элемент.");
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияПослеУдаления(Элемент)
	
	ЗаписатьНаборФайлов();
	ПрочитатьНаборФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	АдресВХранилище = "";
	ПрочитатьПриложениеНаСервере(ВыбраннаяСтрока,АдресВХранилище);
    ПолучитьФайл(АдресВХранилище,НаборЗаписей[ВыбраннаяСтрока].ИмяФайла,Истина);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборФайлов()
	
	Набор = РегистрыСведений.Файлы.СоздатьНаборЗаписей();
	
	Набор.Отбор.Документ.ВидСравнения = ВидСравнения.Равно;
	Набор.Отбор.Документ.Значение = Объект.Ссылка;
	Набор.Отбор.Документ.Использование = Истина;
	
	Набор.Отбор.Скрытый.ВидСравнения = ВидСравнения.Равно;
	Набор.Отбор.Скрытый.Значение = Ложь;
	Набор.Отбор.Скрытый.Использование = Истина;
	
	Набор.Прочитать(); 
	
	ЗначениеВДанныеФормы(Набор,НаборЗаписей);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборФайлов()
	
	Набор = РеквизитФормыВЗначение("НаборЗаписей");
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьВсеПриложенияНаСервере(УИД)
		
	Струк = РегистрыСведений.Файлы.ПрочитатьФайлы(УИД, Объект.Ссылка);
	Возврат Струк
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьВсеПриложения()
	
	КаталогФайлов = КаталогВременныхФайлов() + "МенеджерБТИ\";
	
	СоздатьКаталог(КаталогФайлов);
	
	ОбщаяСтруктура = ПрочитатьВсеПриложенияНаСервере(ЭтаФорма.УникальныйИдентификатор); 
	
	МасПрикрепленныеКартинки = ОбщаяСтруктура.ПрикрепленныеКартинки;
	Если МасПрикрепленныеКартинки.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из МасПрикрепленныеКартинки Цикл
			ТекСтрока.Имя = КаталогФайлов + ТекСтрока.Имя;
		КонецЦикла;
		ПолучитьФайлы(МасПрикрепленныеКартинки,,,Ложь);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПриложениеНаСервере(ВыбранноеИмяФайла, АдресВХранилище)
	
	РегистрыСведений.Файлы.ЗаписатьФайл(ВыбранноеИмяФайла, Объект.Ссылка, АдресВХранилище);
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьПриложениеНаСервере(ВыбраннаяСтрока, Адрес)
	
	МЗ = РегистрыСведений.Файлы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, НаборЗаписей[ВыбраннаяСтрока]);
	МЗ.Прочитать();
	
	Струк = Новый Структура("ИмяФайла, Документ", МЗ.ИмяФайла, Мз.Документ);
	
	Адрес = РегистрыСведений.Файлы.ПрочитатьФайл(Струк, ЭтаФорма.УникальныйИдентификатор); 
	
КонецПроцедуры

#КонецОбласти


