
&НаКлиенте
Процедура Ок(Команда)
	ОбработатьВводПароля();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	//ОбработатьВводПароля();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводПароля()
	
	МодульКриптографииКлиент.ЗаписатьМастерПарольВПараметрыСеанса(Пароль);
	
	Если МодульКриптографииКлиент.НебходимоВвестиМастерПароль() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введен неверный пароль";
		Сообщение.Поле = "Пароль";  
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
	Иначе
		ОткрытьФорму("Справочник.Пароли.Форма.ФормаСписка");
		ЭтаФорма.Закрыть();
	КонецЕсли; 
	
КонецПроцедуры

