
Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	//Отказ = Истина;
	//СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ);
	
КонецПроцедуры

//...



Процедура глЗавершениеРаботыПользователей() Экспорт 
	
	ВремяЗавершения = '0001 01 01 23 00 00';
	
	ТекущееВремя = Дата("00010101" + Формат(ТекущаяДата(), "ДФ='HHmmss'"));
	
	Если ВремяЗавершения - 60 <= ТекущееВремя И ТекущееВремя <= ВремяЗавершения + 60 Тогда
		ЗавершитьРаботуСистемы();
	КонецЕсли;
	
КонецПроцедуры                                                

Процедура ПриНачалеРаботыСистемы()
	
	ПодключитьОбработчикОжидания("глЗавершениеРаботыПользователей", 60);
	
КонецПроцедуры


Процедура ПриЗавершенииРаботыСистемы()
	
	// Уберем за собой мусор
	СтандартныеПодсистемыКлиент.ОчиститьКаталогВременныхФайлов();
	
КонецПроцедуры

