

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	СтрИмяПользователя = ПолноеИмяПользователя();
	Если ПустаяСтрока(СтрИмяПользователя) Тогда
		СтрИмяПользователя = ИмяПользователя();
	КонецЕсли;

	СсылкаПользователь = Справочники.Пользователи.НайтиПоНаименованию(СтрИмяПользователя);
	Если СсылкаПользователь.Пустая() Тогда
		ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
		ОбъектПользователь.Наименование = СтрИмяПользователя;
		ОбъектПользователь.Записать();
		СсылкаПользователь = ОбъектПользователь.Ссылка;
	КонецЕсли;

	ПараметрыСеанса.ТекущийПользователь = СсылкаПользователь;

КонецПроцедуры




