
&НаКлиенте
Процедура СформироватьДерево(Команда)
	
	СформироватьДеревоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоНаСервере()
	
	Если (Объект.ВыбДокумент = Неопределено) ИЛИ (Объект.ВыбДокумент.Пустая()) Тогда
		Возврат	
	КонецЕсли; 
	
	РеквизитФормыВЗначение("Объект").ЗаполнитьТабДокДеревоСвязанныхОбъектов(ПолеТабличногоДокументаДерево);
	ПолеТабличногоДокументаДерево.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВыбДокумент = Параметры.ВыбДокумент;
	СформироватьДеревоНаСервере();
	
КонецПроцедуры
