
Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда
		
		// Сравним изменения
		ДвижениеНеобходимо = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияСтатейСрезПоследних.Период,
		|	ИсторияСтатейСрезПоследних.Наименование,
		|	ИсторияСтатейСрезПоследних.Документ,
		|	ИсторияСтатейСрезПоследних.Каталог,
		|	ИсторияСтатейСрезПоследних.ТекстHTML,
		|	ИсторияСтатейСрезПоследних.Автор
		|ИЗ
		|	РегистрСведений.ИсторияСтатей.СрезПоследних(&Период, ) КАК ИсторияСтатейСрезПоследних
		|ГДЕ
		|	ИсторияСтатейСрезПоследних.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Документ", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если Выборка.Наименование = Наименование и 
				Выборка.Каталог = Каталог и
				Выборка.ТекстHTML = ТекстHTML Тогда
				
				ДвижениеНеобходимо = Ложь;
				
			КонецЕсли; 
		КонецЕсли;
		
		Если ДвижениеНеобходимо Тогда
			// Сделать движение в регистр истории
			ЗаписьРС = РегистрыСведений.ИсторияСтатей.СоздатьМенеджерЗаписи();
			
			ЗаписьРС.Период = Дата;
			ЗаписьРС.Каталог = Каталог;
			ЗаписьРС.Автор = Автор;
			ЗаписьРС.Наименование = Наименование;
			ЗаписьРС.Документ = Ссылка;
			ЗаписьРС.ТекстHTML = ТекстHTML;
			
			ЗаписьРС.Записать();
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

