
&НаКлиенте
Процедура ИзменитьМастерПароль(Команда)
	
	Если ЗначениеЗаполнено(СтарыйПароль) Тогда
		МодульКриптографииКлиент.УстановитьЗначениеМастерПароля(СтарыйПароль);
	КонецЕсли; 
	
	Если НЕ МодульКриптографииКлиент.НебходимоВвестиМастерПароль() Тогда
		Если НовыйПароль = ПодтверждениеНовогоПароля Тогда
			МодульКриптографииКлиент.УстановитьЗначениеМастерПароля(НовыйПароль);
			МодульКриптографииКлиент.ЗаписатьМастерПарольВПараметрыСеанса(НовыйПароль);
		КонецЕсли;	
	КонецЕсли; 

	// Тут нужно добавить процедуру перешифрования
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ МодульКриптографииКлиент.НебходимоВвестиМастерПароль() Тогда
		Элементы.СтарыйПароль.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

