
Процедура ДействияПередЗавершениемРаботыСистемыВОбработчикахСлужебногоСобытия(Неопределен, Параметры) Экспорт

	Если ИнтерактивнаяОбработкаПередЗавершениемРаботыСистемы(Параметры) Тогда
		Возврат;
	КонецЕсли;
	//Режим = РежимДиалогаВопрос.ДаНет;
	//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ОбщийКлиент);
	//Отказ = Истина;
	//ПоказатьВопрос(Оповещение, НСтр("ru = 'Продолжить выполнение операции?';"
	//    + " en = 'Do you want to continue?'"), Режим, 0);	
	
КонецПроцедуры

Процедура ДействияПередЗавершениемРаботыСистемыОбработкаЗавершения(Неопределен, Параметры) Экспорт
	
	Если Параметры.ОповещениеЗавершения <> Неопределено Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Отказ", Параметры.Отказ);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеЗавершения, Результат);
		
	ИначеЕсли НЕ Параметры.Отказ И НЕ Параметры.НепрерывноеВыполнение Тогда
		
		ЗавершитьРаботуСистемы();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ = Ложь, Знач ОповещениеЗавершения = Неопределено) Экспорт
	
	НачатьИнтерактивнуюОбработкуПередЗавершениемРаботыСистемы();
	
	Параметры = Новый Структура;
	
	// Внешние параметры описания результата.
	Параметры.Вставить("Отказ", Ложь);
	
	// Внешние параметры управления выполнением.
	Параметры.Вставить("ИнтерактивнаяОбработка", Неопределено); // ОписаниеОповещения.
	Параметры.Вставить("ОбработкаПродолжения",   Неопределено); // ОписаниеОповещения.
	Параметры.Вставить("НепрерывноеВыполнение", Истина);
	
	// Внутренние параметры.
	Параметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	Параметры.Вставить("ОбработкаЗавершения", Новый ОписаниеОповещения(
		"ДействияПередЗавершениемРаботыСистемыОбработкаЗавершения", ЭтотОбъект, Параметры));
	
	Параметры.Вставить("НомерСледующегоОбработчика", 1);
	Параметры.Вставить("ОбработкаПродолжения", Новый ОписаниеОповещения(
		"ДействияПередЗавершениемРаботыСистемыВОбработчикахСлужебногоСобытия", ЭтотОбъект, Параметры));
	
	ВыполнитьОбработкуОповещения(Параметры.ОбработкаПродолжения);
	
	//Если Параметры.Отказ Или НЕ Параметры.НепрерывноеВыполнение Тогда
		//Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры

Функция ИнтерактивнаяОбработкаПередЗавершениемРаботыСистемы(Параметры)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияИнтерактивнаяОбработкаПередЗавершениемРаботыСистемы", 0.1, Истина);
	
	Возврат Истина;
	
КонецФункции

Процедура НачатьИнтерактивнуюОбработкуПередЗавершениемРаботыСистемы() Экспорт 
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ОбщийКлиент);
	Отказ = Истина;
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Завершить работу системы?';"
	    + " en = 'Завершить работу системы?'"), Режим, 0);	
		
КонецПроцедуры

Процедура ОчиститьКаталогВременныхФайлов() Экспорт 
	
	мКаталогВременныхФайлов = ОбщийКлиент.офПолучитьКаталогВременныхФайлов();
	УдалитьФайлы(мКаталогВременныхФайлов, "*.*");
		
КонецПроцедуры

