&НаКлиенте
Процедура ЗагрузитьСписокПользователей(Команда)
	
	ТД = Новый ТекстовыйДокумент;
	ТД.Прочитать(ИмяФайла);
	КолСтрок = ТД.КоличествоСтрок();
	Для НомерСтроки=1 по КолСтрок Цикл
		
		ВремСтр = ТД.ПолучитьСтроку(НомерСтроки);
		ВремСтр = СтрЗаменить(ВремСтр,";",Символы.ПС);
		Если СтрЧислоСтрок(ВремСтр)<7 Тогда
			Сообщить("В строке "+НомерСтроки+" не верный формат, пропускаю!");	
			Продолжить;
		КонецЕсли;
		
		Общий.СоздатьПользователяБД(СокрЛП(СтрПолучитьСтроку(ВремСтр,1)),
		                      СокрЛП(СтрПолучитьСтроку(ВремСтр,2)),
		                      СокрЛП(СтрПолучитьСтроку(ВремСтр,3)),
		                      СокрЛП(СтрПолучитьСтроку(ВремСтр,4)),
		                      СокрЛП(СтрПолучитьСтроку(ВремСтр,5)),
		                      СокрЛП(СтрПолучитьСтроку(ВремСтр,6)),
		                      СокрЛП(СтрПолучитьСтроку(ВремСтр,7))
		                      );
		
	КонецЦикла;
	
КонецПроцедуры
