
// Насибуллин И.Р. 02.02.2018 TM-2015 
&НаКлиенте
Процедура ПутьКПапкеАвтотестовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка= Ложь;
	ПутьККаталогу = "";
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    Диалог.Заголовок = "Укажите путь к папке автотестов модуля";

    Если ЗначениеЗаполнено(Объект.ПутьКПапкеАвтотестов) Тогда
        Диалог.ПолноеИмяФайла= Объект.ПутьКПапкеАвтотестов;
    КонецЕсли;

    Если Диалог.Выбрать() Тогда
        Объект.ПутьКПапкеАвтотестов = Диалог.ПолноеИмяФайла;
    КонецЕсли;

КонецПроцедуры
