
 
&НаКлиенте
Процедура Поле1Выбор(Элемент, ВыбраннаяДата)
	
	Если Элемент.ВыделенныеДаты <> Неопределено 
		И Элемент.ВыделенныеДаты.Количество() > 1 Тогда
		
		СтандартныйПериод.ДатаНачала = Элемент.ВыделенныеДаты.Получить(0);
		СтандартныйПериод.ДатаОкончания = Элемент.ВыделенныеДаты.Получить(Элемент.ВыделенныеДаты.Количество() - 1);
		
	Иначе
		
		СтандартныйПериод.ДатаНачала = НачалоДня(ВыбраннаяДата);
 		
 		СтандартныйПериод.ДатаОкончания = КонецДня(ВыбраннаяДата);
	
	КонецЕсли;

	Закрыть(СтандартныйПериод);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьГод(Команда)
	
 Если Команда.Имя  = "ВыбратьГод" Тогда
 
 	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
	
	Период.ДатаНачала = НачалоГода(ЭтаФорма.Дата);
	Период.ДатаОкончания = КонецГода(ЭтаФорма.Дата);
    ЗакрытьЭтуФорму(Период);
	
 ИначеЕсли Команда.Имя  = "ГодВперед" Тогда
	
	 ЭтаФорма.Дата = КонецГода(ЭтаФорма.Дата);
	 ЭтаФорма.Дата = ЭтаФорма.Дата + 1;
	 
 ИначеЕсли Команда.Имя  = "ГодНазад" Тогда	
	 
	 ЭтаФорма.Дата = НачалоГода(ЭтаФорма.Дата);
	 ЭтаФорма.Дата = ЭтаФорма.Дата - 1;
	 
	 
 КонецЕсли;	
 
    ОформлениеКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЭтуФорму(Период)
	
	
	СтандартныйПериод.ДатаНачала = Период.ДатаНачала;
 		
 	СтандартныйПериод.ДатаОкончания = Период.ДатаОкончания;
	
	Закрыть(СтандартныйПериод);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеКнопок()
	
	Этаформа.Заголовок = Формат(Дата, "ДФ=yyyy");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.Дата = Дата(1,1,1) Тогда
		
		ЭтаФорма.Дата = ТекущаяДата();
		
	КонецЕсли;
	
	ОформлениеКнопок();
	НомерКлика = 1;

КонецПроцедуры

&НаКлиенте
Процедура НажатиеМесяц(Команда)
	
    ИмяКоманды = Команда.Имя;
	
	НомерМесяца = Число(СтрЗаменить(Команда.Имя,"ГруппаПервоеПолугодиеМесяц",""));
	
	ТекущийГод = Год(ЭтаФорма.Дата);
	               
	ЭтаФорма.Дата = Дата(ТекущийГод,НомерМесяца,1);
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
	
	Период.ДатаНачала = НачалоМесяца(ЭтаФорма.Дата);
	Период.ДатаОкончания = КонецМесяца(ЭтаФорма.Дата);
	
    ЗакрытьЭтуФорму(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеПолугодие(Команда)
	
	  ИмяКоманды = Команда.Имя;
	  Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
	  ТекущийГод = Год(ЭтаФорма.Дата);
	  
	  Если ИмяКоманды = "ВыбратьПервоеПолугодие" Тогда
		  
		ПорядковыйНомер = 1;
		  
		  
	  ИначеЕсли  ИмяКоманды = "ВыбратьВтороеПолугодие" Тогда
		  
		 ПорядковыйНомер = 2; 
		  
	  КонецЕсли;
	  
	Период.ДатаНачала = Дата(ТекущийГод, ?(ПорядковыйНомер = 1, 1 ,6), 1);
	Период.ДатаОкончания  = КонецМесяца(Дата(ТекущийГод, 6 * ПорядковыйНомер, 1));
	
	ЗакрытьЭтуФорму(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКвартал(Команда)
	
	ИмяКоманды = Команда.Имя;
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
	ТекущийГод = Год(ЭтаФорма.Дата);
	
	Если ИмяКоманды = "ВыбратьПервоеПолугодиеПервыйКвартал" Тогда
		
		 ПорядковыйНомер = 1;
		
	ИначеЕсли ИмяКоманды = "ВыбратьПервоеПолугодиеВторойКвартал" Тогда
		
		ПорядковыйНомер = 2;
		
	ИначеЕсли ИмяКоманды = "ВыбратьВтороеПолугодиеПервыйКвартал" Тогда
		
		ПорядковыйНомер = 3;
		
	ИначеЕсли ИмяКоманды = "ВыбратьВтороеПолугодиеВторойКвартал" Тогда
		
		ПорядковыйНомер = 4;
				
	КонецЕсли;
	
	Период.ДатаНачала = НачалоКвартала(Дата(ТекущийГод, 3 * ПорядковыйНомер, 1));
	Период.ДатаОкончания = КонецМесяца(Дата(ТекущийГод, 3 * ПорядковыйНомер, 1));
	
	ЗакрытьЭтуФорму(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНаКалендаре(Команда)
	
	ИмяКоманды = Команда.Имя;
	
	НомерМесяца = Число(СтрЗаменить(Команда.Имя,"МесяцНаКалендаре",""));
	
	ТекущийГод = Год(ЭтаФорма.Дата);
	               
	ЭтаФорма.Дата = Дата(ТекущийГод,НомерМесяца,1);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриАктивизацииДаты(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеПериодаРегистрации(НачалоПериода, КонецПериода = Неопределено, Период = "ГОД") Экспорт

	Если Период = "МЕСЯЦ" Тогда
		Возврат Формат(НачалоПериода, "ДФ='MMMM yyyy'");
	ИначеЕсли Период = "ГОД" Тогда
		Возврат Формат(НачалоПериода, "ДФ='yyyy'") + " год";
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПериодГодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачалоПериода = НачалоГода(ЭтаФорма.Дата);
	КонецПериода =  КонецГода(ЭтаФорма.Дата);    
    НачальноеЗначение = НачалоПериода;
	ПредставлениеПериодаРегистрации = ПолучитьПредставлениеПериодаРегистрации(НачалоПериода, КонецПериода, "ГОД");
	
	НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, НачалоПериода, ЭтаФорма, ПредставлениеПериодаРегистрации, КонецПериода = Неопределено, НачальноеЗначение, "ГОД");
	ЭтаФорма.Дата = НачалоПериода;
	ОформлениеКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, НачалоПериода, ПредставлениеПериодаРегистрации, КонецПериода = Неопределено, Период = "ГОД") Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если Период = "МЕСЯЦ" Тогда
		Если Направление = 1 Тогда
			НачалоПериода = КонецМесяца(НачалоПериода) + 1;
		ИначеЕсли Направление = -1 Тогда
			НачалоПериода = НачалоМесяца(НачалоПериода - 1);
		КонецЕсли;
	ИначеЕсли Период = "ГОД" Тогда
		Если Направление = 1 Тогда
			НачалоПериода = КонецГода(НачалоПериода) + 1;
		ИначеЕсли Направление = -1 Тогда
			НачалоПериода = НачалоГода(НачалоПериода - 1);
		КонецЕсли;
		
		Если КонецПериода <> Неопределено Тогда
			КонецПериода = КонецГода(НачалоПериода);
		КонецЕсли;
	КонецЕсли;
	
	ПредставлениеПериодаРегистрации = ПолучитьПредставлениеПериодаРегистрации(НачалоПериода, КонецПериода, Период);

КонецПроцедуры

// Процедура обрабатывает событие начала выбора из списка в поле периода регистрации
// Процедура исполняется только на клиенте
//
&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, НачалоПериода, ЭтаФорма, ПредставлениеПериодаРегистрации, КонецПериода = Неопределено, НачальноеЗначение = Неопределено, Период = "ГОД") Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = НачалоПериода;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Период = "МЕСЯЦ" Тогда
		
		НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
		НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
		СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
		НачалоМесяцаЗаполнения = НачалоТекущегоГода;
		
		ЭлементПоУмолчанию = Неопределено;
		
		Для а = 1 По 12 Цикл
			
			ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
			
			Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
				
				ЭлементПоУмолчанию = ДобавленныйЭлемент;
				
			КонецЕсли; 
			
			НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
			
		КонецЦикла;
		
		НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
		СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
		
		ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, Элемент, ЭлементПоУмолчанию);
		
		Если ВыбранныйЭлемент = Неопределено Тогда
			
			Возврат;
			
		ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(НачальноеЗначение) Тогда
			
			НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, НачалоПериода, ЭтаФорма, ПредставлениеПериодаРегистрации, КонецПериода, ВыбранныйЭлемент.Значение, Период);
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли Период = "ГОД" Тогда
		
		// отображаем ближайших 5 лет
		Летка = 5;
		
		НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
		
		// Надо чтобы он был на 5 лет назад
		ЗначениеПрошлого = НачалоТекущегоГода;
		
		Для а = 1 По Летка Цикл
			
			ЗначениеПрошлого = НачалоГода(ЗначениеПрошлого - 1);
			
		КонецЦикла;
		НачалоПрошлого = НачалоГода(НачалоТекущегоГода - 1);
		СписокВыбора.Добавить(ЗначениеПрошлого, (Формат(НачалоПрошлого, "ДФ='yyyy'") + "..."));
		
		НачалоЗаполнения = НачалоТекущегоГода;
		
		ЭлементПоУмолчанию = Неопределено;
		
		Для а = 1 По Летка Цикл
			
			ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоЗаполнения, ПолучитьПредставлениеПериодаРегистрации(НачалоЗаполнения, , Период));
			
			Если НачальноеЗначение = НачалоЗаполнения Тогда
				
				ЭлементПоУмолчанию = ДобавленныйЭлемент;
				
			КонецЕсли; 
			
			НачалоЗаполнения = КонецГода(НачалоЗаполнения)+ 1;
			
		КонецЦикла;
		
		НачалоСледующего = НачалоЗаполнения;
		СписокВыбора.Добавить(НачалоСледующего, (Формат(НачалоСледующего, "ДФ='yyyy'") + "..."));
		
		ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, Элемент, ЭлементПоУмолчанию);
		
		Если ВыбранныйЭлемент = Неопределено Тогда
			
			Возврат;
			
		ИначеЕсли ВыбранныйЭлемент.Значение = ЗначениеПрошлого ИЛИ ВыбранныйЭлемент.Значение = НачалоСледующего Тогда
			
			НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, НачалоПериода, ЭтаФорма, ПредставлениеПериодаРегистрации, КонецПериода, ВыбранныйЭлемент.Значение, Период);
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	НачалоПериода = ВыбранныйЭлемент.Значение;
	
	Если КонецПериода <> Неопределено Тогда
		
		КонецПериода = КонецГода(НачалоПериода);
		
	КонецЕсли;
	
	ПредставлениеПериодаРегистрации = ПолучитьПредставлениеПериодаРегистрации(НачалоПериода, , Период);
	
КонецПроцедуры

&НаКлиенте
Функция ДатаКакМесяцПредставление(ДатаДата) Экспорт
	
	Возврат Формат(ДатаДата, "ДФ='ММММ гггг'");
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ДобавитьКнопкиВыбораГода();
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкиВыбораГода(НачальноеЗначение = Неопределено)
		 
	 Пока Элементы.КоманднаяПанельВыборГода.ПодчиненныеЭлементы.Количество() > 0 Цикл
		 
		 Элементы.Удалить(Элементы.КоманднаяПанельВыборГода.ПодчиненныеЭлементы.Получить(0)); 
		 
	 КонецЦикла;
	 
	 Если НачальноеЗначение = Неопределено Тогда
		 
		 Если ЭтаФорма.Дата = Дата(1,1,1) Тогда
			 
			 НачальноеЗначение = ТекущаяДата();
			 
		 Иначе
			 
			 НачальноеЗначение = ЭтаФорма.Дата;
			 
		 КонецЕсли;
		
	 КонецЕсли;
	 
	 КнопкаНазад = Элементы.Добавить("ГодНазад",Тип("КнопкаФормы"), Элементы.КоманднаяПанельВыборГода);
     КнопкаНазад.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	 КнопкаНазад.Заголовок = "...";
	 КнопкаНазад.ИмяКоманды = "КомандаГодНазад";
	 
	 ГодСтрокой = Формат(Год(НачальноеЗначение),"ЧГ=");
	 
	 НоваяКнопка = Элементы.Добавить("ВыборГода" + ГодСтрокой,Тип("КнопкаФормы"), Элементы.КоманднаяПанельВыборГода);
	 НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	 НоваяКнопка.Заголовок = ГодСтрокой;
	 
	 НоваяКоманда = ЭтаФорма.Команды.Найти("ВыборГода" + ГодСтрокой);
	 
	 Если НоваяКоманда = Неопределено Тогда 
		 
		 НоваяКоманда = ЭтаФорма.Команды.Добавить("ВыборГода" + ГодСтрокой);
		 
	 КонецЕсли;

	 НоваяКнопка.ИмяКоманды = "ВыборГода" + ГодСтрокой;
	 НоваяКоманда.Действие = "ВыборГода";
	 Летка = 5;
	 
	 Для а = 1 по Летка Цикл
		 
	 НачальноеЗначение = ДобавитьМесяц(НачальноеЗначение, 12);
		
	 ГодСтрокой = Формат(Год(НачальноеЗначение),"ЧГ=");
	 НоваяКнопка = Элементы.Добавить("ВыборГода" + ГодСтрокой,Тип("КнопкаФормы"), Элементы.КоманднаяПанельВыборГода);
	 НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	 НоваяКнопка.Заголовок = ГодСтрокой;
	 
	 НоваяКоманда = ЭтаФорма.Команды.Найти("ВыборГода" + ГодСтрокой);
	 
	 Если НоваяКоманда = Неопределено Тогда 
		 
		 НоваяКоманда = ЭтаФорма.Команды.Добавить("ВыборГода" + ГодСтрокой);
		 
	 КонецЕсли;
	 
	 НоваяКнопка.ИмяКоманды = "ВыборГода" + ГодСтрокой;
	 НоваяКоманда.Действие = "ВыборГода";
 
	 КонецЦикла;
	 
	 
	 КнопкаВперед = Элементы.Добавить("ГодВперед",Тип("КнопкаФормы"), Элементы.КоманднаяПанельВыборГода);
     КнопкаВперед.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	 КнопкаВперед.Заголовок = "...";
	 КнопкаВперед.ИмяКоманды = "КомандаГодВперед";
	 
КонецПроцедуры

&НаКлиенте
Процедура ВыборГода(Команда)
	
	ИмяКоманды = Команда.Имя;
	
	НомерГода = Число(СтрЗаменить(ИмяКоманды,"ВыборГода",""));
	
	Если НомерКлика = 1 Тогда
		
		ЭтаФорма.Дата = Дата(НомерГода,1,1);
		
	ИначеЕсли НомерКлика = 2 Тогда
		
		
		Период = Новый СтандартныйПериод;
		  
		Период.ДатаНачала = ЭтаФорма.Дата;
		Период.ДатаОкончания =  КонецГода(Дата(НомерГода,1,1));
		ЗакрытьЭтуФорму(Период);
		
	КонецЕсли;
	
	НомерКлика = 2;
	
	ОформлениеКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГодВперед(Команда)
	
	ДатаНачальная = ЭтаФорма.Дата;
	
	ДобавитьКнопкиВыбораГода(ДатаНачальная);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГодНазад(Команда)
	
	ИмяКоманды = Элементы.КоманднаяПанельВыборГода.ПодчиненныеЭлементы.Получить(1).ИмяКоманды;
	
	НомерГода = Число(СтрЗаменить(ИмяКоманды,"ВыборГода",""));
	
	Если ЗначениеЗаполнено(ЭтаФорма.Дата) Тогда
		
		ДатаНачальная = ДобавитьМесяц(ЭтаФорма.Дата, - 12 * 6);
		
	Иначе
	
		ДатаНачальная = ДобавитьМесяц(Дата(НомерГода,1,1), - 12 * 6);
	
	КонецЕсли;

	ДобавитьКнопкиВыбораГода(ДатаНачальная);
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартныйПериод(Команда)
	
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактирования.Период = СтандартныйПериод;
	ДиалогРедактирования.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		
		ЗакрытьЭтуФорму(ДиалогРедактирования.Период);
		
	КонецЕсли;
	
КонецПроцедуры



