
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Исполнитель) И ЗначениеЗаполнено(Запись.Задача) Тогда 
		Запись.Исполнитель = Запись.Задача.Исполнитель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Период) Тогда 
		Запись.Период = ?(ЗначениеЗаполнено(Запись.ДатаНачалаПлан), Запись.ДатаНачалаПлан, ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Задача) Тогда 
		Запись.Задача = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланПриИзменении(Элемент)
	
	Если Запись.ДатаНачалаПлан > Запись.ДатаОкончанияПлан Тогда 
		Запись.ДатаОкончанияПлан = Запись.ДатаНачалаПлан;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НайтиЗадачуНаСервере()

	ЗадачаСсылка = Общий.офПолучитьЗадачуПоНомеру(Запись.Задача);
	
	Если ЗадачаСсылка <> Неопределено Тогда
		Запись.Задача = ЗадачаСсылка;
	Иначе
		Сообщить("Не удалось найти задачу по указанному номеру");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗадачу(Команда)
	
	НайтиЗадачуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Не ЗначениеЗаполнено(Запись.Задача) Тогда 
		Запись.Задача = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запись.Задача = "";
	
КонецПроцедуры
