
&НаКлиенте
Функция  ЭтоНовый()
	
	Возврат Не ЗначениеЗаполнено(Параметры.Ключ);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.Задача.ТолькоПросмотр = Не ЭтоНовый();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		//Запись.Дата = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗадачаПриИзменении(Элемент)
	ЗадачаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗадачаПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Запись.МодульСистемы) Тогда 
		Запись.МодульСистемы = Запись.Задача.Модуль;
	КонецЕсли;
	
КонецПроцедуры

