

&НаКлиенте
Процедура НавСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//Диалог.ПолноеИмяФайла = URL;
	//Диалог.Заголовок = "Выберите файл";
	//Диалог.Фильтр = "Все файлы|*.*";

	//Если Диалог.Выбрать() Тогда
	//	URL = Диалог.ПолноеИмяФайла;
	//КонецЕсли;
	
	СЗ = Новый СписокЗначений;
	СЗ.Добавить("Задача");
	СЗ.Добавить("Статья");
	ВыбранныйЭлемент = СЗ.ВыбратьЭлемент("Выберите источник ссылки");
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Если ВыбранныйЭлемент.Значение = "Задача" Тогда
			ВыбраннаяЗадача = ПолучитьФорму("Документ.Задача.ФормаВыбора").ОткрытьМодально();
			Если ВыбраннаяЗадача <> Неопределено Тогда
				НавСсылка = ПолучитьНавигационнуюСсылку(ВыбраннаяЗадача);
				ПредставлениеСсылки = ВыбраннаяЗадача;
			КонецЕсли; 
		ИначеЕсли ВыбранныйЭлемент.Значение = "Статья" Тогда
			
			ВыбраннаяСтатья = ПолучитьФорму("Документ.Статья.ФормаВыбора").ОткрытьМодально();
			Если ВыбраннаяСтатья <> Неопределено Тогда
				НавСсылка = ПолучитьНавигационнуюСсылку(ВыбраннаяСтатья);
				ПредставлениеСсылки = ВыбраннаяЗадача;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПоOK(Команда)
	Если НавСсылка <> "" Тогда
		//Струк = Новый Структура("Представление, Путь", ПредставлениеСсылки, НавСсылка);
		Закрыть(НавСсылка);
	КонецЕсли;
КонецПроцедуры
